# Data Acquisition & Summary
Do your work for these exercises in a file named acquire.

1. Use the pydataset module to load the iris data set into a dataframe, df_iris

In [1]:
import env
import pandas as pd
import numpy as np
import pydataset
from pydataset import data
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
# THIS USED TO BE IN A SEPARATE FILE AND I SOMEHOW USED IT... 
# NEED TO FIGURE OUT WHAT I DID
# def get_connection(db, user=env.user, host=env.host, password=env.password):
#     return f'mysql+pymysql://{user}:{password}@{host}/{db}'
# get_connection (iris_db, user, host, password)

In [3]:
df_iris = pydataset.data('iris')

- print the first 3 rows

In [4]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

- print the number of rows and columns (shape)

In [5]:
df_iris.shape

(150, 5)

- print the column names

In [6]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

- print the data type of each column

In [7]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

- print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [8]:
df_iris.describe()
# It depends on what you want to do with the data, but I think rescaling
# is always a good idea.

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

2. Read the data tab from the stats module dataset, Excel_Stats.xlsx, into a dataframe, df_excel

In [9]:
df_excel = pd.read_excel(open('Excel_Stats.xlsx', 'rb'),
              sheet_name='Data')  # doctest: +SKIP

- assign the first 100 rows to a new dataframe, df_excel_sample

In [10]:
df_excel_sample = df_excel[:100]

- print the number of rows of your original dataframe

In [11]:
df_excel_sample.shape[0]

100

- print the first 5 column names

In [12]:
list(df_excel_sample.columns)[:5]

['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents']

- print the column names that have a data type of object compute the range for each of the numeric variables.

In [13]:
df_excel_sample.dtypes

customer_id           object
gender                object
is_senior_citizen      int64
partner               object
dependents            object
tenure                 int64
phone_service          int64
internet_service       int64
contract_type          int64
payment_type          object
monthly_charges      float64
total_charges        float64
churn                 object
dtype: object

In [14]:
list(df_excel_sample.loc[:, df_excel_sample.dtypes == object].columns)

['customer_id', 'gender', 'partner', 'dependents', 'payment_type', 'churn']

In [15]:
# another way
df_excel_sample.select_dtypes(include=['object']).columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [16]:
df_excel_sample.dtypes[df_excel_sample.dtypes == 'object'].index

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [17]:
df_excel_sample.max()

customer_id            0177-PXBAT
gender                       Male
is_senior_citizen               1
partner                       Yes
dependents                    Yes
tenure                         72
phone_service                   2
internet_service                2
contract_type                   2
payment_type         Mailed check
monthly_charges             116.8
total_charges              8496.7
churn                         Yes
dtype: object

In [18]:
list(df_excel_sample.loc[:, df_excel_sample.dtypes == float].columns)

['monthly_charges', 'total_charges']

In [19]:
for col in list(df_excel_sample.loc[:, df_excel_sample.dtypes == float].columns):
    print(df_excel_sample[col].max())

116.8
8496.7

In [20]:
for col in list(df_excel_sample.loc[:, df_excel_sample.dtypes == float].columns):
    range = df_excel_sample[col].max() - df_excel_sample[col].min()
    print('range for {} is {}.'.format(col, range))

range for monthly_charges is 97.4.
range for total_charges is 8476.85.

In [21]:
for col in df_excel_sample[df_excel_sample.select_dtypes('number').columns]:
    r = df_excel_sample[col].max() - df_excel_sample[col].min()
    print(f'{col}: {r}')

is_senior_citizen: 1
tenure: 71
phone_service: 2
internet_service: 2
contract_type: 2
monthly_charges: 97.4
total_charges: 8476.85

In [22]:
#df_excel_sample.apply(lambda s: s.max() - s.min())

In [23]:
#df_excel_sample[df_excel_sample.select_dtypes('number').columns].apply(lambda s: s.max() - s.min()

3. Find the train.csv file shared through classroom in topic 'Classification'. Get the contents of this file into a dataframe labeled df_google

In [24]:
path = '~/desktop/ds-methodologies-exercises/Classification/'
df_google = pd.read_csv(path + 'train.csv')

- print the first 3 rows

In [25]:
df_google.head(3)

,rowid,date,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
0,1,2015-02-04 17:51:00,23.18,27.2720,426.0,721.25,0.004793,1
1,2,2015-02-04 17:51:59,23.15,27.2675,429.5,714.00,0.004783,1
2,3,2015-02-04 17:53:00,23.15,27.2450,426.0,713.50,0.004779,1

- print the number of rows and columns

In [26]:
df_google.shape

(8143, 8)

- print the column names

In [27]:
df_google.columns

Index(['rowid', 'date', 'Temperature', 'Humidity', 'Light', 'CO2',
       'HumidityRatio', 'Occupancy'],
      dtype='object')

- print the data type of each column

In [28]:
df_google.dtypes

rowid              int64
date              object
Temperature      float64
Humidity         float64
Light            float64
CO2              float64
HumidityRatio    float64
Occupancy          int64
dtype: object

- print the summary statistics for each of the numeric variables

In [29]:
df_google.describe()

,rowid,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
count,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000
mean,4072.000000,20.619084,25.731507,119.519375,606.546243,0.003863,0.212330
std,2350.825954,1.016916,5.531211,194.755805,314.320877,0.000852,0.408982
min,1.000000,19.000000,16.745000,0.000000,412.750000,0.002674,0.000000
25%,2036.500000,19.700000,20.200000,0.000000,439.000000,0.003078,0.000000
50%,4072.000000,20.390000,26.222500,0.000000,453.500000,0.003801,0.000000
75%,6107.500000,21.390000,30.533333,256.375000,638.833333,0.004352,0.000000
max,8143.000000,23.180000,39.117500,1546.333333,2028.500000,0.006476,1.000000

- print the unique values for each of your categorical variables

In [30]:
for col in df_google:
    if df_google[col].dtype == object:
        print(df_google[col].unique())

['2015-02-04 17:51:00' '2015-02-04 17:51:59' '2015-02-04 17:53:00' ...
 '2015-02-10 09:30:59' '2015-02-10 09:32:00' '2015-02-10 09:33:00']

4. In mysql workbench or a terminal, write a query to select all the columns of the passengers table from the titanic database. Export that table to a csv you store locally. Read that csv into a dataframe df_csv.

In [31]:
path = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/titanic_db'

- print the head and tail of your new dataframe

In [32]:
df = pd.read_sql('SELECT * FROM passengers', path)
pd.concat([df.head(), df.tail()])

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1
886,886,0,2,male,27.0,0,0,13.0000,S,Second,None,Southampton,1
887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.4500,S,Third,None,Southampton,0
889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,None,Queenstown,1

- print the number of rows and columns

In [33]:
df.shape

(891, 13)

- print the column names

In [34]:
df.columns

Index(['passenger_id', 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch',
       'fare', 'embarked', 'class', 'deck', 'embark_town', 'alone'],
      dtype='object')

- print the data type of each column

In [35]:
df.dtypes

passenger_id      int64
survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class            object
deck             object
embark_town      object
alone             int64
dtype: object

- print the summary statistics for each numeric variable

In [36]:
df.describe()

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,445.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,0.602694
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,0.489615
min,0.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,222.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,445.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,1.000000
75%,667.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,890.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

- print the unique values for each categorical variables. If there are more than 5 distinct values, print the top 5 in terms of prevelence or frequency.

In [37]:
cols = ["survived", "pclass", "sibsp", "parch", "embarked", "class", "deck", "alone"]
for col in cols:
    print(f"{col}: {pd.Series(df[col].value_counts().index.values).unique()[:5]}")
cols = ["survived", "pclass", "sibsp", "parch", "embarked", "class", "deck", "alone"]

survived: [0 1]
pclass: [3 1 2]
sibsp: [0 1 2 4 3]
parch: [0 1 2 5 3]
embarked: ['S' 'C' 'Q']
class: ['Third' 'First' 'Second']
deck: ['C' 'B' 'D' 'E' 'A']
alone: [1 0]

In [38]:
for col in cols:
    print(f"{col:>10}: {', '.join(pd.Series(df[col].value_counts().index.values).astype(str).unique()[:5])}")
df2 = df.drop(columns=(['passenger_id', 'age', 'fare']))

  survived: 0, 1
    pclass: 3, 1, 2
     sibsp: 0, 1, 2, 4, 3
     parch: 0, 1, 2, 5, 3
  embarked: S, C, Q
     class: Third, First, Second
      deck: C, B, D, E, A
     alone: 1, 0

In [39]:
for col in df2:
    if len(df2[col].value_counts()) > 5:
        print(df2[col].value_counts()[0:5])
    else:
        print(df2[col].value_counts())

0    549
1    342
Name: survived, dtype: int64
3    491
1    216
2    184
Name: pclass, dtype: int64
male      577
female    314
Name: sex, dtype: int64
0    608
1    209
2     28
4     18
3     16
Name: sibsp, dtype: int64
0    678
1    118
2     80
5      5
3      5
Name: parch, dtype: int64
S    644
C    168
Q     77
Name: embarked, dtype: int64
Third     491
First     216
Second    184
Name: class, dtype: int64
C    59
B    47
D    33
E    32
A    15
Name: deck, dtype: int64
Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64
1    537
0    354
Name: alone, dtype: int64

In [40]:
for col in df.select_dtypes(object):
    print(col, (df[col].unique()[:5]))

sex ['male' 'female']
embarked ['S' 'C' 'Q' None]
class ['Third' 'First' 'Second']
deck [None 'C' 'E' 'G' 'D']
embark_town ['Southampton' 'Cherbourg' 'Queenstown' None]

In [41]:
{col: list(df[col].unique())[:5] for col in df.select_dtypes(object)}

{'sex': ['male', 'female'],
 'embarked': ['S', 'C', 'Q', None],
 'class': ['Third', 'First', 'Second'],
 'deck': [None, 'C', 'E', 'G', 'D'],
 'embark_town': ['Southampton', 'Cherbourg', 'Queenstown', None]}

5. Create a file named acquire.py.

This file should define at least two functions

- get_titanic_data: returns the titanic data from the codeup data science database as a pandas data frame.

In [42]:
path = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/titanic_db'
df = pd.read_sql('SELECT * FROM passengers', path)
df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [43]:
from acquire import get_titanic_data
get_titanic_data

- get_iris_data: returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids.

In [44]:
from pydataset import data
df_iris = pydataset.data('iris')
df_iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa
4           4.6          3.1           1.5          0.2  setosa
5           5.0          3.6           1.4          0.2  setosa

In [45]:
from acquire import get_iris_data
get_iris_data

We will use these functions in later exercises.

- print the number of rows and columns

In [51]:
df_iris.shape

(150, 5)

- print the column names

In [52]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

- print the data type of each column

In [53]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

- print the summary statistics for each numeric variable

In [54]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

- print the unique values for each categorical variables. If there are more than 5 distince values, print the top 5 in terms of prevelence or frequency.

In [82]:
column_list = df_iris.columns.values.tolist()

for column_name in column_list:
      print(sorted(df_iris[column_name].unique()[:5]))
      print()

[4.6, 4.7, 4.9, 5.0, 5.1]

[3.0, 3.1, 3.2, 3.5, 3.6]

[1.3, 1.4, 1.5, 1.6, 1.7]

[0.1, 0.2, 0.3, 0.4, 0.5]

['setosa', 'versicolor', 'virginica']

In [46]:
#stop here... below is a copy of Zach's work in class

In [47]:
# copy of Zach's work in class:
# IPython log file


# import pandas as pd
# import numpy as np
# import pydataset
# pydataset.data('iris')
# iris = pydataset.data('iris')
# iris
# iris.shape
# iris.columns
# [col.lower().replace('.', '_') for col in iris]
# iris.columns = [col.lower().replace('.', '_') forcol in iris]
# iris.head()
# iris.dtypes
# iris.describe()
# help(pd.read_excel)
# pd.read_excel('/Users/zach/codeup/cohorts/ada/Excel_Stats.xlsx', sheet='Data')
# df = pd.read_excel('/Users/zach/codeup/cohorts/ada/Excel_Stats.xlsx', sheet='Data')
# df.head()
# df.head()
# df = pd.read_excel('/Users/zach/codeup/cohorts/ada/Excel_Stats.xlsx', sheet_name='Data')
# df.head()
# help(pd.read_excel)
# df.head()
# df_excel = df.head(100)
# df_excel
# df_excel_sample = df.head(100)
# df_excel_sample
# help(pd.read_excel)
# df_excel_sample.columns[:5]
# df.columns[:5]
# df.types
# df.dtypes
# df.info()
# type(df.info())
# get_ipython().run_line_magic('pinfo', 'df.info')
# list(df.loc[:, df.dtypes == 'object'])
# object_columns = list(df.loc[:, df.dtypes == 'object'])
# df.select_dtypes(include=['object'])
# df.select_dtypes(include=['object']).columns
# df.dtypes
# df.dtypes[df.dtypes == 'object']
# df.dtypes[df.dtypes == 'object']
# df.dtypes[df.dtypes == 'object'].index
# df.dtypes
# df.select_dtypes(['int', 'float'])
# df.select_dtypes(['int', 'float']).columns
# df.select_dtypes('number').columns
# for col in df[df.select_dtypes('number').columns]:
#     r = df[col].max() - df[col].min()
#     print(f'col: {r}')

# for col in df[df.select_dtypes('number').columns]:
#     r = df[col].max() - df[col].min()
#     print(f'{col}: {r}')


# df.apply(lambda s: s.max() - s.min())
# df[df.select_dtypes('number').columns].apply(lambda s: s.max() - s.min())
# pd.read_csv('https://classroom.google.com/u/0/w/Mjc3NjgxNDE5NjJa/t/all')
# df = pd.read_csv('https://zach.lol/train.csv')
# df.head()
# df.shape
# df.columns
# df.dtypes
# df.describe()
# df.Occupancy.unique()
# df.head()
# df.head()
# import env
# url = f'mysql+pymysql://{env.username}:{env.password}@{env.hostname}/titanic_db'
# df = pd.read_sql('SELECT * FROM passengers', url)
# df.head()
# df.shape
# df.to_csv('titanic.csv')
# get_ipython().system('ls')
# pd.concat([df.head(), df.tail()])
# pd.concat([df.head(), df.tail()])
# df.dtypes
# df.describe()
# df.dtypes
# df.sex.unique()
# df.embarked.unique()
# df.class.unique()
# df['class']
# df['class'].unique()
# df.dtypes
# df.groupby('deck').count()
# df.deck.value_counts()
# df.fare
# df.fare.value_counts()
# df.fare.value_counts(bins=3)

# # 
# cols = ["survived", "pclass", "sibsp", "parch", "embarked", "class", "deck", "alone"]
# for col in cols:
#     print(f"{col}: {pd.Series(df_csv[col].value_counts().index.values).unique()[:5]}")
# cols = ["survived", "pclass", "sibsp", "parch", "embarked", "class", "deck", "alone"]
# for col in cols:
#     print(f"{col:>10}: {', '.join(pd.Series(df[col].value_counts().index.values).astype(str).unique()[:5])}")
# df_csv2 = df_csv.drop(columns=(['passenger_id', 'age', 'fare']))
# # 
# for col in df_csv2:
#     if len(df_csv2[col].value_counts()) > 5:
#         print(df_csv2[col].value_counts()[0:5])
#     else:
#         print(df_csv2[col].value_counts())
# # 
# for col in df.select_dtypes(object):
#     print(col, (df[col].unique()[:5]))
# #
# {col: list(df[col].unique())[:5] for col in df.select_dtypes(object)}

# n = []
# i = []
# for t in df.columns:
#     n.append(df[t].unique())
#     i.append(t)

# pd.DataFrame( n, index=i)